0:003> ~
   0  Id: 830.958 Suspend: 1 Teb: 00000099`195e5000 Unfrozen
   1  Id: 830.1ebc Suspend: 1 Teb: 00000099`195f1000 Unfrozen
   2  Id: 830.12c Suspend: 1 Teb: 00000099`195f3000 Unfrozen
.  3  Id: 830.71c Suspend: 1 Teb: 00000099`195f5000 Unfrozen

0:003> k
 # Child-SP          RetAddr               Call Site
00 00000099`1967f708 00007ffb`10f3c88e     ntdll!DbgBreakPoint
01 00000099`1967f710 00007ffb`10c57034     ntdll!DbgUiRemoteBreakin+0x4e
02 00000099`1967f740 00007ffb`10ebcec1     KERNEL32!BaseThreadInitThunk+0x14
03 00000099`1967f770 00000000`00000000     ntdll!RtlUserThreadStart+0x21

0:003> ~2s
ntdll!NtWaitForWorkViaWorkerFactory+0x14:
00007ffb`10f0f7f4 c3              ret

0:002> k
 # Child-SP          RetAddr               Call Site
00 00000099`193cf8b8 00007ffb`10e823d7     ntdll!NtWaitForWorkViaWorkerFactory+0x14
01 00000099`193cf8c0 00007ffb`10c57034     ntdll!TppWorkerThread+0x2f7
02 00000099`193cfbc0 00007ffb`10ebcec1     KERNEL32!BaseThreadInitThunk+0x14
03 00000099`193cfbf0 00000000`00000000     ntdll!RtlUserThreadStart+0x21

0:002> ~1k
 # Child-SP          RetAddr               Call Site
00 00000099`1934f448 00007ffb`10e823d7     ntdll!NtWaitForWorkViaWorkerFactory+0x14
01 00000099`1934f450 00007ffb`10c57034     ntdll!TppWorkerThread+0x2f7
02 00000099`1934f750 00007ffb`10ebcec1     KERNEL32!BaseThreadInitThunk+0x14
03 00000099`1934f780 00000000`00000000     ntdll!RtlUserThreadStart+0x21

0:002> ~
   0  Id: 830.958 Suspend: 1 Teb: 00000099`195e5000 Unfrozen
   1  Id: 830.1ebc Suspend: 1 Teb: 00000099`195f1000 Unfrozen
.  2  Id: 830.12c Suspend: 1 Teb: 00000099`195f3000 Unfrozen
#  3  Id: 830.71c Suspend: 1 Teb: 00000099`195f5000 Unfrozen

0:002> ~0s
win32u!NtUserGetMessage+0x14:
00007ffb`0eca1104 c3              ret

0:000> k
 # Child-SP          RetAddr               Call Site
00 00000099`192cf618 00007ffb`0efe1b3e     win32u!NtUserGetMessage+0x14
01 00000099`192cf620 00007ff6`ee5db344     USER32!GetMessageW+0x2e
02 00000099`192cf680 00007ff6`ee5f3b86     notepad!wWinMain+0x2b4
03 00000099`192cf730 00007ffb`10c57034     notepad!__scrt_common_main_seh+0x106
04 00000099`192cf770 00007ffb`10ebcec1     KERNEL32!BaseThreadInitThunk+0x14
05 00000099`192cf7a0 00000000`00000000     ntdll!RtlUserThreadStart+0x21

0:000> ~
.  0  Id: 830.958 Suspend: 1 Teb: 00000099`195e5000 Unfrozen
   1  Id: 830.1ebc Suspend: 1 Teb: 00000099`195f1000 Unfrozen
   2  Id: 830.12c Suspend: 1 Teb: 00000099`195f3000 Unfrozen
#  3  Id: 830.71c Suspend: 1 Teb: 00000099`195f5000 Unfrozen

0:000> ? 0x830
Evaluate expression: 2096 = 00000000`00000830

0:000> ? 0x958
Evaluate expression: 2392 = 00000000`00000958

0:000> !teb 00000099`195e5000
TEB at 00000099195e5000
    ExceptionList:        0000000000000000
    StackBase:            00000099192d0000
    StackLimit:           00000099192bf000
    SubSystemTib:         0000000000000000
    FiberData:            0000000000001e00
    ArbitraryUserPointer: 0000000000000000
    Self:                 00000099195e5000
    EnvironmentPointer:   0000000000000000
    ClientId:             0000000000000830 . 0000000000000958
    RpcHandle:            0000000000000000
    Tls Storage:          0000019f88f469c0
    PEB Address:          00000099195e4000
    LastErrorValue:       0
    LastStatusValue:      c0000034
    Count Owned Locks:    0
    HardErrorMode:        0

0:000> dt nt!_TEB
ntdll!_TEB
   +0x000 NtTib            : _NT_TIB
   +0x038 EnvironmentPointer : Ptr64 Void
   +0x040 ClientId         : _CLIENT_ID
   +0x050 ActiveRpcHandle  : Ptr64 Void
   +0x058 ThreadLocalStoragePointer : Ptr64 Void
   +0x060 ProcessEnvironmentBlock : Ptr64 _PEB
   +0x068 LastErrorValue   : Uint4B
   +0x06c CountOfOwnedCriticalSections : Uint4B
   +0x070 CsrClientThread  : Ptr64 Void
   +0x078 Win32ThreadInfo  : Ptr64 Void
   +0x080 User32Reserved   : [26] Uint4B
   +0x0e8 UserReserved     : [5] Uint4B
   +0x100 WOW32Reserved    : Ptr64 Void
   +0x108 CurrentLocale    : Uint4B
   +0x10c FpSoftwareStatusRegister : Uint4B
   +0x110 ReservedForDebuggerInstrumentation : [16] Ptr64 Void
   +0x190 SystemReserved1  : [30] Ptr64 Void
   +0x280 PlaceholderCompatibilityMode : Char
   +0x281 PlaceholderHydrationAlwaysExplicit : UChar
   +0x282 PlaceholderReserved : [10] Char
   +0x28c ProxiedProcessId : Uint4B
   +0x290 _ActivationStack : _ACTIVATION_CONTEXT_STACK
   +0x2b8 WorkingOnBehalfTicket : [8] UChar
   +0x2c0 ExceptionCode    : Int4B
   +0x2c4 Padding0         : [4] UChar
   +0x2c8 ActivationContextStackPointer : Ptr64 _ACTIVATION_CONTEXT_STACK
   +0x2d0 InstrumentationCallbackSp : Uint8B
   +0x2d8 InstrumentationCallbackPreviousPc : Uint8B
   +0x2e0 InstrumentationCallbackPreviousSp : Uint8B
   +0x2e8 TxFsContext      : Uint4B
   +0x2ec InstrumentationCallbackDisabled : UChar
   +0x2ed UnalignedLoadStoreExceptions : UChar
   +0x2ee Padding1         : [2] UChar
   +0x2f0 GdiTebBatch      : _GDI_TEB_BATCH
   +0x7d8 RealClientId     : _CLIENT_ID
   +0x7e8 GdiCachedProcessHandle : Ptr64 Void
   +0x7f0 GdiClientPID     : Uint4B
   +0x7f4 GdiClientTID     : Uint4B
   +0x7f8 GdiThreadLocalInfo : Ptr64 Void
   +0x800 Win32ClientInfo  : [62] Uint8B
   +0x9f0 glDispatchTable  : [233] Ptr64 Void
   +0x1138 glReserved1      : [29] Uint8B
   +0x1220 glReserved2      : Ptr64 Void
   +0x1228 glSectionInfo    : Ptr64 Void
   +0x1230 glSection        : Ptr64 Void
   +0x1238 glTable          : Ptr64 Void
   +0x1240 glCurrentRC      : Ptr64 Void
   +0x1248 glContext        : Ptr64 Void
   +0x1250 LastStatusValue  : Uint4B
   +0x1254 Padding2         : [4] UChar
   +0x1258 StaticUnicodeString : _UNICODE_STRING
   +0x1268 StaticUnicodeBuffer : [261] Wchar
   +0x1472 Padding3         : [6] UChar
   +0x1478 DeallocationStack : Ptr64 Void
   +0x1480 TlsSlots         : [64] Ptr64 Void
   +0x1680 TlsLinks         : _LIST_ENTRY
   +0x1690 Vdm              : Ptr64 Void
   +0x1698 ReservedForNtRpc : Ptr64 Void
   +0x16a0 DbgSsReserved    : [2] Ptr64 Void
   +0x16b0 HardErrorMode    : Uint4B
   +0x16b4 Padding4         : [4] UChar
   +0x16b8 Instrumentation  : [11] Ptr64 Void
   +0x1710 ActivityId       : _GUID
   +0x1720 SubProcessTag    : Ptr64 Void
   +0x1728 PerflibData      : Ptr64 Void
   +0x1730 EtwTraceData     : Ptr64 Void
   +0x1738 WinSockData      : Ptr64 Void
   +0x1740 GdiBatchCount    : Uint4B
   +0x1744 CurrentIdealProcessor : _PROCESSOR_NUMBER
   +0x1744 IdealProcessorValue : Uint4B
   +0x1744 ReservedPad0     : UChar
   +0x1745 ReservedPad1     : UChar
   +0x1746 ReservedPad2     : UChar
   +0x1747 IdealProcessor   : UChar
   +0x1748 GuaranteedStackBytes : Uint4B
   +0x174c Padding5         : [4] UChar
   +0x1750 ReservedForPerf  : Ptr64 Void
   +0x1758 ReservedForOle   : Ptr64 Void
   +0x1760 WaitingOnLoaderLock : Uint4B
   +0x1764 Padding6         : [4] UChar
   +0x1768 SavedPriorityState : Ptr64 Void
   +0x1770 ReservedForCodeCoverage : Uint8B
   +0x1778 ThreadPoolData   : Ptr64 Void
   +0x1780 TlsExpansionSlots : Ptr64 Ptr64 Void
   +0x1788 DeallocationBStore : Ptr64 Void
   +0x1790 BStoreLimit      : Ptr64 Void
   +0x1798 MuiGeneration    : Uint4B
   +0x179c IsImpersonating  : Uint4B
   +0x17a0 NlsCache         : Ptr64 Void
   +0x17a8 pShimData        : Ptr64 Void
   +0x17b0 HeapData         : Uint4B
   +0x17b4 Padding7         : [4] UChar
   +0x17b8 CurrentTransactionHandle : Ptr64 Void
   +0x17c0 ActiveFrame      : Ptr64 _TEB_ACTIVE_FRAME
   +0x17c8 FlsData          : Ptr64 Void
   +0x17d0 PreferredLanguages : Ptr64 Void
   +0x17d8 UserPrefLanguages : Ptr64 Void
   +0x17e0 MergedPrefLanguages : Ptr64 Void
   +0x17e8 MuiImpersonation : Uint4B
   +0x17ec CrossTebFlags    : Uint2B
   +0x17ec SpareCrossTebBits : Pos 0, 16 Bits
   +0x17ee SameTebFlags     : Uint2B
   +0x17ee SafeThunkCall    : Pos 0, 1 Bit
   +0x17ee InDebugPrint     : Pos 1, 1 Bit
   +0x17ee HasFiberData     : Pos 2, 1 Bit
   +0x17ee SkipThreadAttach : Pos 3, 1 Bit
   +0x17ee WerInShipAssertCode : Pos 4, 1 Bit
   +0x17ee RanProcessInit   : Pos 5, 1 Bit
   +0x17ee ClonedThread     : Pos 6, 1 Bit
   +0x17ee SuppressDebugMsg : Pos 7, 1 Bit
   +0x17ee DisableUserStackWalk : Pos 8, 1 Bit
   +0x17ee RtlExceptionAttached : Pos 9, 1 Bit
   +0x17ee InitialThread    : Pos 10, 1 Bit
   +0x17ee SessionAware     : Pos 11, 1 Bit
   +0x17ee LoadOwner        : Pos 12, 1 Bit
   +0x17ee LoaderWorker     : Pos 13, 1 Bit
   +0x17ee SkipLoaderInit   : Pos 14, 1 Bit
   +0x17ee SpareSameTebBits : Pos 15, 1 Bit
   +0x17f0 TxnScopeEnterCallback : Ptr64 Void
   +0x17f8 TxnScopeExitCallback : Ptr64 Void
   +0x1800 TxnScopeContext  : Ptr64 Void
   +0x1808 LockCount        : Uint4B
   +0x180c WowTebOffset     : Int4B
   +0x1810 ResourceRetValue : Ptr64 Void
   +0x1818 ReservedForWdf   : Ptr64 Void
   +0x1820 ReservedForCrt   : Uint8B
   +0x1828 EffectiveContainerId : _GUID

0:000> dt nt!_TEB 00000099`195e5000
ntdll!_TEB
   +0x000 NtTib            : _NT_TIB
   +0x038 EnvironmentPointer : (null) 
   +0x040 ClientId         : _CLIENT_ID
   +0x050 ActiveRpcHandle  : (null) 
   +0x058 ThreadLocalStoragePointer : 0x0000019f`88f469c0 Void
   +0x060 ProcessEnvironmentBlock : 0x00000099`195e4000 _PEB
   +0x068 LastErrorValue   : 0
   +0x06c CountOfOwnedCriticalSections : 0
   +0x070 CsrClientThread  : (null) 
   +0x078 Win32ThreadInfo  : 0x00000000`00000958 Void
   +0x080 User32Reserved   : [26] 0
   +0x0e8 UserReserved     : [5] 0
   +0x100 WOW32Reserved    : 0x00000000`0000014c Void
   +0x108 CurrentLocale    : 0x409
   +0x10c FpSoftwareStatusRegister : 0
   +0x110 ReservedForDebuggerInstrumentation : [16] (null) 
   +0x190 SystemReserved1  : [30] (null) 
   +0x280 PlaceholderCompatibilityMode : 0 ''
   +0x281 PlaceholderHydrationAlwaysExplicit : 0 ''
   +0x282 PlaceholderReserved : [10]  ""
   +0x28c ProxiedProcessId : 0
   +0x290 _ActivationStack : _ACTIVATION_CONTEXT_STACK
   +0x2b8 WorkingOnBehalfTicket : [8]  ""
   +0x2c0 ExceptionCode    : 0n0
   +0x2c4 Padding0         : [4]  ""
   +0x2c8 ActivationContextStackPointer : 0x00000099`195e5290 _ACTIVATION_CONTEXT_STACK
   +0x2d0 InstrumentationCallbackSp : 0
   +0x2d8 InstrumentationCallbackPreviousPc : 0
   +0x2e0 InstrumentationCallbackPreviousSp : 0
   +0x2e8 TxFsContext      : 0xfffe
   +0x2ec InstrumentationCallbackDisabled : 0 ''
   +0x2ed UnalignedLoadStoreExceptions : 0 ''
   +0x2ee Padding1         : [2]  ""
   +0x2f0 GdiTebBatch      : _GDI_TEB_BATCH
   +0x7d8 RealClientId     : _CLIENT_ID
   +0x7e8 GdiCachedProcessHandle : (null) 
   +0x7f0 GdiClientPID     : 0
   +0x7f4 GdiClientTID     : 0
   +0x7f8 GdiThreadLocalInfo : (null) 
   +0x800 Win32ClientInfo  : [62] 0x388
   +0x9f0 glDispatchTable  : [233] (null) 
   +0x1138 glReserved1      : [29] 0
   +0x1220 glReserved2      : (null) 
   +0x1228 glSectionInfo    : (null) 
   +0x1230 glSection        : (null) 
   +0x1238 glTable          : (null) 
   +0x1240 glCurrentRC      : (null) 
   +0x1248 glContext        : (null) 
   +0x1250 LastStatusValue  : 0xc0000034
   +0x1254 Padding2         : [4]  ""
   +0x1258 StaticUnicodeString : _UNICODE_STRING ""
   +0x1268 StaticUnicodeBuffer : [261]  ""
   +0x1472 Padding3         : [6]  ""
   +0x1478 DeallocationStack : 0x00000099`19250000 Void
   +0x1480 TlsSlots         : [64] (null) 
   +0x1680 TlsLinks         : _LIST_ENTRY [ 0x00000000`00000000 - 0x00000000`00000000 ]
   +0x1690 Vdm              : (null) 
   +0x1698 ReservedForNtRpc : 0xababaa34`5628f54e Void
   +0x16a0 DbgSsReserved    : [2] (null) 
   +0x16b0 HardErrorMode    : 0
   +0x16b4 Padding4         : [4]  ""
   +0x16b8 Instrumentation  : [11] (null) 
   +0x1710 ActivityId       : _GUID {00000000-0000-0000-0000-000000000000}
   +0x1720 SubProcessTag    : (null) 
   +0x1728 PerflibData      : (null) 
   +0x1730 EtwTraceData     : (null) 
   +0x1738 WinSockData      : (null) 
   +0x1740 GdiBatchCount    : 0
   +0x1744 CurrentIdealProcessor : _PROCESSOR_NUMBER
   +0x1744 IdealProcessorValue : 0
   +0x1744 ReservedPad0     : 0 ''
   +0x1745 ReservedPad1     : 0 ''
   +0x1746 ReservedPad2     : 0 ''
   +0x1747 IdealProcessor   : 0 ''
   +0x1748 GuaranteedStackBytes : 0
   +0x174c Padding5         : [4]  ""
   +0x1750 ReservedForPerf  : (null) 
   +0x1758 ReservedForOle   : 0x0000019f`88f3a0f0 Void
   +0x1760 WaitingOnLoaderLock : 0
   +0x1764 Padding6         : [4]  ""
   +0x1768 SavedPriorityState : (null) 
   +0x1770 ReservedForCodeCoverage : 0
   +0x1778 ThreadPoolData   : (null) 
   +0x1780 TlsExpansionSlots : (null) 
   +0x1788 DeallocationBStore : (null) 
   +0x1790 BStoreLimit      : (null) 
   +0x1798 MuiGeneration    : 0
   +0x179c IsImpersonating  : 0
   +0x17a0 NlsCache         : (null) 
   +0x17a8 pShimData        : (null) 
   +0x17b0 HeapData         : 0xea330000
   +0x17b4 Padding7         : [4]  ""
   +0x17b8 CurrentTransactionHandle : (null) 
   +0x17c0 ActiveFrame      : (null) 
   +0x17c8 FlsData          : 0x0000019f`88f29f50 Void
   +0x17d0 PreferredLanguages : (null) 
   +0x17d8 UserPrefLanguages : 0x0000019f`88f2da20 Void
   +0x17e0 MergedPrefLanguages : 0x0000019f`88f31970 Void
   +0x17e8 MuiImpersonation : 1
   +0x17ec CrossTebFlags    : 0
   +0x17ec SpareCrossTebBits : 0y0000000000000000 (0)
   +0x17ee SameTebFlags     : 0x420
   +0x17ee SafeThunkCall    : 0y0
   +0x17ee InDebugPrint     : 0y0
   +0x17ee HasFiberData     : 0y0
   +0x17ee SkipThreadAttach : 0y0
   +0x17ee WerInShipAssertCode : 0y0
   +0x17ee RanProcessInit   : 0y1
   +0x17ee ClonedThread     : 0y0
   +0x17ee SuppressDebugMsg : 0y0
   +0x17ee DisableUserStackWalk : 0y0
   +0x17ee RtlExceptionAttached : 0y0
   +0x17ee InitialThread    : 0y1
   +0x17ee SessionAware     : 0y0
   +0x17ee LoadOwner        : 0y0
   +0x17ee LoaderWorker     : 0y0
   +0x17ee SkipLoaderInit   : 0y0
   +0x17ee SpareSameTebBits : 0y0
   +0x17f0 TxnScopeEnterCallback : (null) 
   +0x17f8 TxnScopeExitCallback : (null) 
   +0x1800 TxnScopeContext  : (null) 
   +0x1808 LockCount        : 0
   +0x180c WowTebOffset     : 0n0
   +0x1810 ResourceRetValue : 0x0000019f`88f2d9a0 Void
   +0x1818 ReservedForWdf   : (null) 
   +0x1820 ReservedForCrt   : 0
   +0x1828 EffectiveContainerId : _GUID {00000000-0000-0000-0000-000000000000}
0:000> dx -r1 (*((ntdll!_NT_TIB *)0x99195e5000))
(*((ntdll!_NT_TIB *)0x99195e5000))                 [Type: _NT_TIB]
    [+0x000] ExceptionList    : 0x0 [Type: _EXCEPTION_REGISTRATION_RECORD *]
    [+0x008] StackBase        : 0x99192d0000 [Type: void *]
    [+0x010] StackLimit       : 0x99192bf000 [Type: void *]
    [+0x018] SubSystemTib     : 0x0 [Type: void *]
    [+0x020] FiberData        : 0x1e00 [Type: void *]
    [+0x020] Version          : 0x1e00 [Type: unsigned long]
    [+0x028] ArbitraryUserPointer : 0x0 [Type: void *]
    [+0x030] Self             : 0x99195e5000 [Type: _NT_TIB *]

0:000> bp ntdll!NtCreateFile

0:000> bl
     0 e Disable Clear  00007ffb`10f0c830     0001 (0001)  0:**** ntdll!NtCreateFile

0:000> g
ModLoad: 00007ffb`0fba0000 00007ffb`0fc7a000   C:\Windows\System32\comdlg32.dll
ModLoad: 00007ffb`0a200000 00007ffb`0a2f7000   C:\Windows\system32\PROPSYS.dll
ModLoad: 00007ffb`0fa00000 00007ffb`0fb2a000   C:\Windows\System32\ole32.dll
ModLoad: 00007ffa`f6460000 00007ffa`f660e000   C:\Windows\System32\DUI70.dll
ModLoad: 00007ffa`fbb10000 00007ffa`fbba5000   C:\Windows\System32\DUser.dll
ModLoad: 00007ffb`0c310000 00007ffb`0c33f000   C:\Windows\System32\dwmapi.dll
ModLoad: 00007ffb`09450000 00007ffb`09604000   C:\Windows\system32\WindowsCodecs.dll
ModLoad: 00007ffb`0e5b0000 00007ffb`0e5d7000   C:\Windows\System32\bcrypt.dll
ModLoad: 00007ffa`fae30000 00007ffa`fb051000   C:\Windows\system32\explorerframe.dll
ModLoad: 00007ffb`0e4e0000 00007ffb`0e506000   C:\Windows\system32\profapi.dll
Breakpoint 0 hit
ntdll!NtCreateFile:
00007ffb`10f0c830 4c8bd1          mov     r10,rcx

0:000> r rip
rip=00007ffb10f0c830

0:000> u
ntdll!NtCreateFile:
00007ffb`10f0c830 4c8bd1          mov     r10,rcx
00007ffb`10f0c833 b855000000      mov     eax,55h
00007ffb`10f0c838 f604250803fe7f01 test    byte ptr [SharedUserData+0x308 (00000000`7ffe0308)],1
00007ffb`10f0c840 7503            jne     ntdll!NtCreateFile+0x15 (00007ffb`10f0c845)
00007ffb`10f0c842 0f05            syscall
00007ffb`10f0c844 c3              ret
00007ffb`10f0c845 cd2e            int     2Eh
00007ffb`10f0c847 c3              ret

0:000> u 00007ffb10f0c830
ntdll!NtCreateFile:
00007ffb`10f0c830 4c8bd1          mov     r10,rcx
00007ffb`10f0c833 b855000000      mov     eax,55h
00007ffb`10f0c838 f604250803fe7f01 test    byte ptr [SharedUserData+0x308 (00000000`7ffe0308)],1
00007ffb`10f0c840 7503            jne     ntdll!NtCreateFile+0x15 (00007ffb`10f0c845)
00007ffb`10f0c842 0f05            syscall
00007ffb`10f0c844 c3              ret
00007ffb`10f0c845 cd2e            int     2Eh
00007ffb`10f0c847 c3              ret

0:000> p
ntdll!NtCreateFile+0x3:
00007ffb`10f0c833 b855000000      mov     eax,55h

0:000> p
ntdll!NtCreateFile+0x8:
00007ffb`10f0c838 f604250803fe7f01 test    byte ptr [SharedUserData+0x308 (00000000`7ffe0308)],1 ds:00000000`7ffe0308=00

0:000> p
ntdll!NtCreateFile+0x10:
00007ffb`10f0c840 7503            jne     ntdll!NtCreateFile+0x15 (00007ffb`10f0c845) [br=0]

0:000> p
ntdll!NtCreateFile+0x12:
00007ffb`10f0c842 0f05            syscall

0:000> p
ntdll!NtCreateFile+0x14:
00007ffb`10f0c844 c3              ret

0:000> r eax
eax=c0000035

0:000> !error c0000035
Error code: (NTSTATUS) 0xc0000035 (3221225525) - Object Name already exists.

0:000> !error @eax
Error code: (NTSTATUS) 0xc0000035 (3221225525) - Object Name already exists.

0:000> bp ntdll!NtReadFile

0:000> g
Breakpoint 0 hit
ntdll!NtCreateFile:
00007ffb`10f0c830 4c8bd1          mov     r10,rcx

0:000> u
ntdll!NtReadFile:
00007ffb`10f0be50 4c8bd1          mov     r10,rcx
00007ffb`10f0be53 b806000000      mov     eax,6
00007ffb`10f0be58 f604250803fe7f01 test    byte ptr [SharedUserData+0x308 (00000000`7ffe0308)],1
00007ffb`10f0be60 7503            jne     ntdll!NtReadFile+0x15 (00007ffb`10f0be65)
00007ffb`10f0be62 0f05            syscall
00007ffb`10f0be64 c3              ret
00007ffb`10f0be65 cd2e            int     2Eh
00007ffb`10f0be67 c3              ret

0:000> bp ntdll!NtWriteFile

0:000> bl
     0 e Disable Clear  00007ffb`10f0c830     0001 (0001)  0:**** ntdll!NtCreateFile
     1 e Disable Clear  00007ffb`10f0be50     0001 (0001)  0:**** ntdll!NtReadFile
     2 e Disable Clear  00007ffb`10f0be90     0001 (0001)  0:**** ntdll!NtWriteFile

0:000> bd 0

0:000> bd 1

0:000> g
ModLoad: 00007ffb`07dc0000 00007ffb`07e60000   C:\Windows\SYSTEM32\policymanager.dll
ModLoad: 00007ffb`0d700000 00007ffb`0d78a000   C:\Windows\system32\msvcp110_win.dll
ModLoad: 00007ffa`fb100000 00007ffa`fb13e000   C:\Windows\system32\dataexchange.dll
ModLoad: 00007ffb`0a4e0000 00007ffb`0a744000   C:\Windows\system32\d3d11.dll
ModLoad: 00007ffb`0b180000 00007ffb`0b365000   C:\Windows\system32\dcomp.dll
ModLoad: 00007ffb`0cf00000 00007ffb`0cff3000   C:\Windows\system32\dxgi.dll
ModLoad: 00007ffb`00df0000 00007ffb`00e39000   C:\Windows\System32\Windows.UI.FileExplorer.dll
ModLoad: 00007ffb`00dd0000 00007ffb`00de4000   C:\Windows\System32\AssignedAccessRuntime.dll
ModLoad: 00007ffb`0e8b0000 00007ffb`0e8fe000   C:\Windows\System32\CFGMGR32.dll
ModLoad: 00007ffb`0a070000 00007ffb`0a0a6000   C:\Windows\system32\XmlLite.dll
ModLoad: 00007ffa`f1160000 00007ffa`f11c2000   C:\Windows\System32\Windows.FileExplorer.Common.dll
ModLoad: 00007ffa`fd460000 00007ffa`fd46d000   C:\Windows\system32\LINKINFO.dll
ModLoad: 00007ffa`fbbe0000 00007ffa`fbc04000   C:\Windows\system32\edputil.dll
ModLoad: 00007ffa`fb560000 00007ffa`fb606000   C:\Windows\System32\StructuredQuery.dll
ModLoad: 00007ffa`f2390000 00007ffa`f239d000   C:\Windows\SYSTEM32\atlthunk.dll
ModLoad: 00007ffb`063c0000 00007ffb`06670000   C:\Windows\System32\iertutil.dll
ModLoad: 00007ffa`f0bb0000 00007ffa`f0c76000   C:\Windows\system32\Windows.Storage.Search.dll
ModLoad: 00007ffb`0e460000 00007ffb`0e49c000   C:\Windows\system32\SspiCli.dll
ModLoad: 00007ffb`03640000 00007ffb`03659000   C:\Windows\system32\samcli.dll
ModLoad: 00007ffb`0a300000 00007ffb`0a324000   C:\Windows\system32\SAMLIB.dll
ModLoad: 00007ffb`0dad0000 00007ffb`0dadc000   C:\Windows\system32\netutils.dll
ModLoad: 00007ffa`f0570000 00007ffa`f0618000   C:\Program Files\Common Files\microsoft shared\ink\tiptsf.dll
ModLoad: 00007ffa`fdcb0000 00007ffa`fdd59000   C:\Windows\System32\twinapi.dll
ModLoad: 00007ffb`04f20000 00007ffb`04f35000   C:\Windows\System32\vmhgfs.dll
ModLoad: 00007ffb`07060000 00007ffb`0706a000   C:\Windows\System32\VERSION.dll
ModLoad: 00007ffb`04f00000 00007ffb`04f1a000   C:\Windows\System32\VCRUNTIME140.dll
ModLoad: 00007ffb`04ef0000 00007ffb`04efb000   C:\Windows\System32\drprov.dll
ModLoad: 00007ffb`0e2e0000 00007ffb`0e33a000   C:\Windows\System32\WINSTA.dll
ModLoad: 00007ffb`04ed0000 00007ffb`04ee8000   C:\Windows\System32\ntlanman.dll
ModLoad: 00007ffb`04eb0000 00007ffb`04ece000   C:\Windows\System32\davclnt.dll
ModLoad: 00007ffb`04ea0000 00007ffb`04ead000   C:\Windows\System32\DAVHLPR.dll
ModLoad: 00007ffb`0f790000 00007ffb`0f809000   C:\Windows\System32\coml2.dll
ModLoad: 00007ffb`0d790000 00007ffb`0d7a7000   C:\Windows\System32\wkscli.dll
Breakpoint 2 hit
ntdll!NtWriteFile:
00007ffb`10f0be90 4c8bd1          mov     r10,rcx

0:009> u
ntdll!NtWriteFile:
00007ffb`10f0be90 4c8bd1          mov     r10,rcx
00007ffb`10f0be93 b808000000      mov     eax,8
00007ffb`10f0be98 f604250803fe7f01 test    byte ptr [SharedUserData+0x308 (00000000`7ffe0308)],1
00007ffb`10f0bea0 7503            jne     ntdll!NtWriteFile+0x15 (00007ffb`10f0bea5)
00007ffb`10f0bea2 0f05            syscall
00007ffb`10f0bea4 c3              ret
00007ffb`10f0bea5 cd2e            int     2Eh
00007ffb`10f0bea7 c3              ret

0:004> bd *

0:004> bl
     0 d Enable Clear  00007ffb`10f0c830     0001 (0001)  0:**** ntdll!NtCreateFile
     1 d Enable Clear  00007ffb`10f0be50     0001 (0001)  0:**** ntdll!NtReadFile
     2 d Enable Clear  00007ffb`10f0be90     0001 (0001)  0:**** ntdll!NtWriteFile

0:004> .detach
Detached